#+NAME: IsFinite
#+AUTHOR: Johann Rosain

** Surjective map codomain is finite iff it has decidable equality
We show that if f : A \to B is a surjective map and A is finite, then B is finite iff it has decidable equality. In fact, the forward direction is immediate from =is-finite/has-decidable-equality=. We show the converse by induction on the number of elements. First, we set =A= to be =Fin k= and we show that =B= has a count. The base case is trivial, \emptyset \simeq B.
#+begin_src ctt
  has-decidable-equality/is-finite/base/map (B : U) (f : Empty -> B) (H : is-surj Empty B f) : B -> Empty =
    \ b. rec-Prop-trunc
        ( Fib Empty B f b)
        ( Empty/Prop)
        ( \ t. t.1)
        ( H b)

  has-decidable-equality/is-finite/base/right-htpy (B : U) (f : Empty -> B) (H : is-surj Empty B f) (x : Empty)
                                                      : Path Empty (has-decidable-equality/is-finite/base/map B f H (f x)) x =
    ex-falso
      ( Path Empty (has-decidable-equality/is-finite/base/map B f H (f x)) x) x    

  has-decidable-equality/is-finite/base/left-htpy (B : U) (f : Empty -> B) (H : is-surj Empty B f) (b : B)
                                                     : Path B (f (has-decidable-equality/is-finite/base/map B f H b)) b =
    ex-falso
      ( Path B (f (has-decidable-equality/is-finite/base/map B f H b)) b)
      ( rec-Prop-trunc
          ( Fib Empty B f b)
          ( Empty/Prop)
          ( \ t. t.1)
          ( H b))

  has-decidable-equality/is-finite/base (B : U) (f : Empty -> B) (H : is-surj Empty B f) : count B =
    ( zero,
      has-inverse/Equiv Empty B f
        ( has-decidable-equality/is-finite/base/map B f H,
          ( has-decidable-equality/is-finite/base/left-htpy B f H,
            has-decidable-equality/is-finite/base/right-htpy B f H)))
#+end_src
The inductive case is more involved. First, we make it decidable to know whether there is an =x : Fin k= such that f(x) = y.
#+begin_src ctt
  has-decidable-equality/is-finite/decide/eq (B : U) (y : B) (k : Nat) (f : Fin (suc k) -> B) (X : Maybe (Fin (suc k)))
                                                : Coprod (Path B (f (inr star)) y) (neg (Path B (f (inr star)) y)) -> Maybe (Fin (suc k)) = split
    inl _ -> inl (inr star)
    inr _ -> X

  has-decidable-equality/is-finite/iterate-maybe (k : Nat) : (X : Maybe (Fin k)) -> Maybe (Fin (suc k)) = split
    inl x -> inl (inl x)
    inr y -> inr y

  has-decidable-equality/is-finite/decide (B : U) (y : B) (Heq : has-decidable-equality B) : (k : Nat) -> (f : Fin k -> B) -> Maybe (Fin k) = split
    zero -> \ _. inr star
    suc k -> \ f. has-decidable-equality/is-finite/decide/eq B y k f
                ( has-decidable-equality/is-finite/iterate-maybe k (has-decidable-equality/is-finite/decide B y Heq k (\ x. f (inl x))))
                ( Heq (f (inr star)) y)
#+end_src
Thus, we can decide whether inr(\star) is the only preimage of f(inr(\star)) or not. If it is not, it is easy, a count of B is yielded by the induction hypothesis and the surjection is built using the decided value. If it is, there is a surjection between Fin k and B without f(inr(\star)). Then, it suffices to add one to the count yielded to get the right count.

TODO: the definition is fine, but do it with f : Fin (suc k) -> B, so that there are two cases, either f(inr(\star)) appears in Fin k and then show that in this case B is equivalent to the defined type, either it doesn't and then show that B is equivalent to the defined type + 1.
#+begin_src ctt
  has-decidable-equality/is-finite/subtype (k : Nat) (B : U) (f : Fin k -> B) (H : (y : B) -> Fib (Fin k) B f y) : U =
    Sg (Fin k) (\ x. Path (Fin k) (H (f x)).1 x)

  has-decidable-equality/is-finite/map (k : Nat) (B : U) (f : Fin k -> B) (H : (y : B) -> Fib (Fin k) B f y) (t : has-decidable-equality/is-finite/subtype k B f H) : B =
    f (t.1)

  has-decidable-equality/is-finite/inv-map (k : Nat) (B : U) (f : Fin k -> B) (H : (y : B) -> Fib (Fin k) B f y) (y : B) : has-decidable-equality/is-finite/subtype k B f H =
    let x : Fin k = (H y).1
        p : Path B y (f x) = (H y).2
    in
    ( x,
      ap B (Fin k) (\ b. (H b).1) (f x) y (inv B y (f x) p))

  has-decidable-equality/is-finite/right-htpy (k : Nat) (B : U) (f : Fin k -> B) (H : (y : B) -> Fib (Fin k) B f y) (y : B)
                                                 : Path B (has-decidable-equality/is-finite/map k B f H (has-decidable-equality/is-finite/inv-map k B f H y)) y =
    (inv B y (f (H y).1) (H y).2)

  has-decidable-equality/is-finite/left-htpy (k : Nat) (B : U) (f : Fin k -> B) (H : (y : B) -> Fib (Fin k) B f y) (t : has-decidable-equality/is-finite/subtype k B f H)
                                                : Path (has-decidable-equality/is-finite/subtype k B f H)
                                                       (has-decidable-equality/is-finite/inv-map k B f H (has-decidable-equality/is-finite/map k B f H t)) t =
    SgPath-prop
      ( Fin k)
      ( \ x. Path (Fin k) (H (f x)).1 x)
      ( \ x. count/is-set
            ( Fin k)
            ( count/fin-count k)
            ( H (f x)).1 x)
      ( has-decidable-equality/is-finite/inv-map k B f H (has-decidable-equality/is-finite/map k B f H t)) t
      t.2

  has-decidable-equality/is-finite/Equiv (k : Nat) (B : U) (f : Fin k -> B) (H : (y : B) -> Fib (Fin k) B f y)
                                            : Equiv (has-decidable-equality/is-finite/subtype k B f H) B =
    has-inverse/Equiv
      ( has-decidable-equality/is-finite/subtype k B f H) B
      ( has-decidable-equality/is-finite/map k B f H)
      ( has-decidable-equality/is-finite/inv-map k B f H,
        ( has-decidable-equality/is-finite/right-htpy k B f H,
          has-decidable-equality/is-finite/left-htpy k B f H))
#+end_src


#+RESULTS:
: Typecheck has succeeded.
